chrome.contextMenus.create({
    title: "Invert your text --> \"%s \"", 
    contexts:["selection"], 
    onclick: translit,
});

// function copyText(info) { 
 // txt = info.selectionText
 // alert(txt);
// }

function translit(info){
	// Символ, на который будут заменяться все спецсимволы
	var space = '-'; 
	// Берем значение из нужного поля и переводим в нижний регистр
	var text = info.selectionText;
	//var text = document.getElementById('name').value.toLowerCase();	
	// Массив для транслитерации
	var transl = { 
		'q':'й', 'Q':'Й', 'w':'ц', 'W':'Ц', 'e':'у', 'E':'У', 'r':'к', 'R':'К', 't':'е', 'T':'Е', 'y':'н', 'Y':'Н', 'u':'г', 'U':'Г', 'i':'ш', 
		'I':'Ш', 'o':'щ', 'O':'Щ', 'p':'з', 'P':'З', '[':'х', '{':'Х', ']':'ъ', '}':'Ъ', '\\':'\\', '|':'/', 'a':'ф', 'A':'Ф', 's':'ы', 
		'S':'Ы', 'd':'в', 'D':'В', 'f':'а', 'F':'А', 'g':'п', 'G':'П', 'h':'р', 'H':'Р', 'j':'о', 'J':'О', 'k':'л', 'K':'Л', 'l':'д', 'L':'Д', 
		';':'ж', ':':'Ж', '\'':'э','"':'Э', 'z':'я', 
		'Z':'Я',  'x':'ч', 'X':'Ч', 'c':'с', 'C':'С', 'v':'м', 'V':'М', 'b':'и', 'B':'И', 'n':'т', 'N':'Т', 'm':'ь', 'M':'Ь', ',':'б', '<':'Б', 
		'.':'ю', '>':'Ю', '/':'.', '?':', ', 'й':'q', 'Й':'Q', 'ц':'w', 'Ц':'W', 'у':'e', 'У':'E', 'к':'r', 'К':'R', 'е':'t', 'Е':'T', 'н':'y', 
		'Н':'Y', 'г':'u', 'Г':'U', 'ш':'i', 'Ш':'I', 'щ':'o', 'Щ':'O', 'з':'p', 'З':'P', 'х':'[', 'Х':'{', 'ъ':']', 'Ъ':'}', '\\':'\\', 
		'|':'/', 'ф':'a', 'Ф':'A', 'ы':'s', 'Ы':'S', 'в':'d', 'В':'D', 'а':'f', 'А':'F', 'п':'g', 'П':'G', 'р':'h', 'Р':'H', 'о':'j', 
		'О':'J', 'л':'k', 'Л':'K', 'д':'l', 'Д':'L', 'ж':'' , 'Ж':':', 'э':'\'', 'Э':'"', 'я':'z', 'Я':'Z', 'ч':'x', 'Ч':'X', 'с':'c', 
		'С':'C', 'м':'v', 'М':'V', 'и':'b', 'И':'B', 'т':'n', 'Т':'N', 'ь':'m', 'Ь':'M', 'б':',', 'Б':'<', 'ю':'.', 'Ю':'>', ',':'б', 
		'&':'?', '^':':', '$':'' , '#':'№', '@':'"'
		}
	
    var result = '';
	
	var curent_sim = '';
	
    for(i=0; i < text.length; i++) {
        // Если символ найден в массиве то меняем его
		if(transl[text[i]] != undefined) {			
			if(curent_sim != transl[text[i]] ){  //|| curent_sim != space
				result += transl[text[i]];
				curent_sim = transl[text[i]];				
			}					
		}
		// Если нет, то оставляем так как есть
        else {
			result += text[i];
			curent_sim = text[i];
		}		
    }	
	
	//result = TrimStr(result);	
	
	// Выводим результат
	//alert(result);   //////////////result
	window.prompt ("Чтобы скопировать текст в буфер обмена нажмите \nCtrl+C и OK \nВаш инвертированный текст:", result);
	//document.getElementById('alias').value = result;
    
}
function TrimStr(s) {
	s = s.replace(/^-/, '');
	return s.replace(/-$/, '');
}
